Business Understanding -> Data Understanding -> Data Preparation -> Modeling -> Evaluation -> Deployment

- Business Understanding: Netflix 영화 추천 시스템_협업 필터링

- Data Understanding

> Movie.csv

In [2]:
import pandas as pd
movie_df = pd.read_csv('data/Netflix_Dataset_Movie.csv')
movie_df.head()

   Movie_ID  Year                          Name
0         1  2003               Dinosaur Planet
1         2  2004    Isle of Man TT 2004 Review
2         3  1997                     Character
3         4  1994  Paula Abdul's Get Up & Dance
4         5  2004      The Rise and Fall of ECW

In [3]:
movie_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17770 entries, 0 to 17769
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Movie_ID  17770 non-null  int64
 1   Year      17770 non-null  int64
 2   Name      17770 non-null  object
dtypes: int64(2), object(1)
memory usage: 416.6+ KB

> Rating.csv

In [4]:
rating_df = pd.read_csv('data/Netflix_Dataset_Rating.csv')
rating_df.head()

   User_ID  Rating  Movie_ID
0   712664       5         3
1  1331154       4         3
2  2632461       3         3
3    44937       5         3
4   656399       4         3

In [5]:
rating_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17337458 entries, 0 to 17337457
Data columns (total 3 columns):
 #   Column    Dtype
---  ------    -----
 0   User_ID   int64
 1   Rating    int64
 2   Movie_ID  int64
dtypes: int64(3)
memory usage: 396.8 MB

In [6]:
rating_df['Rating'].value_counts()

4    5901368
3    5185650
5    3769803
2    1759281
1     721356
Name: Rating, dtype: int64

In [38]:
same_movie_df = pd.read_csv('data/same_movie.csv')
same_movie_df.head()

   Movie_ID  Year       Name
0       372  1998      Jeans
1      8813  1980  Grown Ups
2       798  1975       Jaws
3     11171  1978     Jaws 2
4      8470  1986     Jaws 3

In [39]:
same_movie_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 658 entries, 0 to 657
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Movie_ID  658 non-null    int64
 1   Year      658 non-null    int64
 2   Name      658 non-null    object
dtypes: int64(2), object(1)
memory usage: 15.5+ KB

In [57]:
merge_df = same_movie_df.merge(rating_df, how='left', on='Movie_ID')
merge_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2216443 entries, 0 to 2216442
Data columns (total 5 columns):
 #   Column    Dtype
---  ------    -----
 0   Movie_ID  int64
 1   Year      int64
 2   Name      object
 3   User_ID   float64
 4   Rating    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 101.5+ MB

In [58]:
merge_df.shape

(2216443, 5)

In [68]:
merge_df.head()

   Movie_ID  Year       Name    User_ID  Rating
0       372  1998      Jeans        NaN     NaN
1      8813  1980  Grown Ups        NaN     NaN
2       798  1975       Jaws  1943087.0     2.0
3       798  1975       Jaws  2423875.0     4.0
4       798  1975       Jaws  1734805.0     4.0

In [59]:
merge_df.isnull().sum()

Movie_ID      0
Year          0
Name          0
User_ID     568
Rating      568
dtype: int64

In [61]:
merge_df['Movie_ID'].nunique()

614

In [53]:
merge_df['Movie_ID'].value_counts()

571      101450
1615      99730
2186      94180
1962      85605
2743      85430
          ...
9146          1
12277         1
16662         1
12656         1
5439          1
Name: Movie_ID, Length: 614, dtype: int64

In [49]:
merge_df

,Movie_ID,Year,Name,User_ID,Rating
0,372,1998,Jeans,NaN,NaN
1,8813,1980,Grown Ups,NaN,NaN
2,798,1975,Jaws,1943087.0,2.0
3,798,1975,Jaws,2423875.0,4.0
4,798,1975,Jaws,1734805.0,4.0
...,...,...,...,...,...
2216438,12744,1969,Who's That Knocking at My Door?,NaN,NaN
2216439,4670,1999,Wild Wild West,NaN,NaN
2216440,14050,1971,Willy Wonka & the Chocolate Factory,NaN,NaN
2216441,5730,2005,XXX: State of the Union,NaN,NaN
2216442,5439,2001,Yaadein,NaN,NaN

In [67]:
# name별 카운트 -> 카운트0인 영화는 날리기
merge_df['Name'].value_counts()

American Beauty                101450
The American President          99730
Bad Boys                        94180
50 First Dates                  85605
The Pianist                     85430
                                ...
The Rugrats Movie                   1
Rugrats in Paris: The Movie         1
In My Country                       1
Drive                               1
Yaadein                             1
Name: Name, Length: 614, dtype: int64

> EDA

In [8]:
movie_rating_df = movie_df.merge(rating_df, how='left', on='Movie_ID')
movie_rating_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17353878 entries, 0 to 17353877
Data columns (total 5 columns):
 #   Column    Dtype
---  ------    -----
 0   Movie_ID  int64
 1   Year      int64
 2   Name      object
 3   User_ID   float64
 4   Rating    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 794.4+ MB

In [9]:
movie_rating_df.isnull().sum()

Movie_ID        0
Year            0
Name            0
User_ID     16420
Rating      16420
dtype: int64

In [10]:
movie_rating_df = movie_rating_df.drop(columns=['Year', 'Name'])
movie_rating_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17353878 entries, 0 to 17353877
Data columns (total 3 columns):
 #   Column    Dtype
---  ------    -----
 0   Movie_ID  int64
 1   User_ID   float64
 2   Rating    float64
dtypes: float64(2), int64(1)
memory usage: 529.6 MB

In [11]:
movie_rating_df.isnull().sum()

Movie_ID        0
User_ID     16420
Rating      16420
dtype: int64

In [12]:
moviemat = movie_rating_df.pivot_table(index='User_ID', columns='Movie_ID', values='Rating')
moviemat.head()

Movie_ID,3,8,16,17,18,26,28,30,32,33,...,4472,4474,4478,4479,4485,4488,4490,4492,4493,4496
User_ID,,,,,,,,,,,,,,,,,,,,,
6.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.0,NaN,NaN,...,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7.0,NaN,5.0,NaN,NaN,NaN,NaN,4.0,5.0,NaN,NaN,...,3.0,NaN,NaN,5.0,NaN,NaN,NaN,NaN,NaN,NaN
79.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.0,NaN,NaN,...,4.0,NaN,NaN,NaN,NaN,NaN,4.0,NaN,NaN,NaN
97.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
134.0,NaN,NaN,NaN,NaN,NaN,NaN,5.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
moviemat.shape

(143458, 1350)

In [14]:
movie_pivot = movie_rating_df.pivot_table(index='Movie_ID', columns='User_ID', values='Rating')
movie_pivot.shape

(1350, 143458)

In [15]:
movie_pivot.head()

User_ID,6.0,7.0,79.0,97.0,134.0,169.0,183.0,188.0,195.0,199.0,...,2649308.0,2649328.0,2649331.0,2649335.0,2649336.0,2649370.0,2649378.0,2649388.0,2649426.0,2649429.0
Movie_ID,,,,,,,,,,,,,,,,,,,,,
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,5.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,4.0,NaN,NaN,NaN,NaN,NaN
16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.0,NaN
18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
movie_pivot.fillna(0, inplace=True)
movie_pivot = movie_pivot.astype('int8')
movie_pivot.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1350 entries, 3 to 4496
Columns: 143458 entries, 6.0 to 2649429.0
dtypes: int8(143458)
memory usage: 184.7 MB

In [17]:
movie_pivot.head()

User_ID,6.0,7.0,79.0,97.0,134.0,169.0,183.0,188.0,195.0,199.0,...,2649308.0,2649328.0,2649331.0,2649335.0,2649336.0,2649370.0,2649378.0,2649388.0,2649426.0,2649429.0
Movie_ID,,,,,,,,,,,,,,,,,,,,,
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8,0,5,0,0,0,0,0,0,0,0,...,0,0,0,0,4,0,0,0,0,0
16,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
17,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,4,0
18,0,0,0,0,0,0,0,0,0,0,...,4,0,0,0,0,0,0,0,0,0

In [18]:
movie_pivot.shape

(1350, 143458)

- Recommendation System

In [19]:
from sklearn.neighbors import NearestNeighbors

In [20]:
n_neighbors = 11
KNN = NearestNeighbors(metric='cosine', n_neighbors=n_neighbors, n_jobs=-1)

In [21]:
KNN.fit(movie_pivot)

NearestNeighbors(metric='cosine', n_jobs=-1, n_neighbors=11)

In [22]:
distances, indices = KNN.kneighbors(movie_pivot)

In [23]:
distances.shape

(1350, 11)

In [24]:
indices.shape

(1350, 11)

In [31]:
import pickle 
with open('distances.pickle','wb') as fw:
    pickle.dump(distances, fw)

In [70]:
import sklearn
sklearn.__version__

'1.2.1'

In [71]:
import numpy
numpy.__version__

'1.23.5'

In [ ]:
distance_indices = []

In [35]:
import pickle 
with open('indices.pickle','wb') as fw:
    pickle.dump(indices, fw)

In [36]:
import pickle 
with open('KNN.pickle','wb') as fw:
    pickle.dump(KNN, fw)

In [37]:
import pickle 
with open('movie_pivot.pickle','wb') as fw:
    pickle.dump(movie_pivot, fw)

In [25]:
movie_pivot.head()

User_ID,6.0,7.0,79.0,97.0,134.0,169.0,183.0,188.0,195.0,199.0,...,2649308.0,2649328.0,2649331.0,2649335.0,2649336.0,2649370.0,2649378.0,2649388.0,2649426.0,2649429.0
Movie_ID,,,,,,,,,,,,,,,,,,,,,
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8,0,5,0,0,0,0,0,0,0,0,...,0,0,0,0,4,0,0,0,0,0
16,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
17,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,4,0
18,0,0,0,0,0,0,0,0,0,0,...,4,0,0,0,0,0,0,0,0,0

In [26]:
import numpy as np
np.where(movie_pivot.index == 18)

(array([4], dtype=int64),)

In [27]:
movie_df[movie_df['Movie_ID'] == 18]

    Movie_ID  Year              Name
17        18  1994  Immortal Beloved

In [28]:
indices[18]

array([  18,  437,  483,  533,  976, 1124,  526,  105,  994,  799, 1349],
      dtype=int64)

In [29]:
distances[18]

array([0.        , 0.78782728, 0.79012489, 0.79448012, 0.79519319,
       0.79731659, 0.80134595, 0.80160087, 0.80542222, 0.80594378,
       0.81011216])

In [2]:
for i in range(n_neighbors):
    book_title = movie_df.loc[movie_df['Movie_ID'] == movie_pivot.index[indices[18][i]], 'Name'].values[0]
    distance = '{:.3f}'.format(distances[18][i])
    print(book_title, 'distance: ', distance)

NameError: name 'movie_df' is not defined

----